#+Title: Additional Config
#+Author: Atanas Janackovski
#+Date: 2020
This is my config for additional packages and thier associated settings. Some of this is taken from other packages, and I will cite them as appropriate.

** DONE Org-mode
CLOSED: [2020-01-18 Sat 23:48]
A global binding for Org-mode. This has been added to the Org Mode in the =.config.org.=
Org-mode supports [[http://orgmode.org/manual/Hyperlinks.html#Hyperlinks][links]], this command allows you to store links.
globally for later insertion into an Org-mode buffer.
See [[http://orgmode.org/manual/Handling-links.html#Handling-links][Handling-links]] in the Org-mode manual.
#+begin_src emacs-lisp :tangle no
  (use-package org
    :init
    (define-key map-global ("\C-c l") 'org-store-link)
    (define-key map-global ("\C-c a") 'org-agenda)
    (define-key map-global ("\C-c c") 'org-capture)
    (setq org-log-done 'time
          org-agenda-files (list "/Users/atanas/Dropbox/Apps/org/work.org"
                                 "/Users/atanas/Dropbox/Apps/org/home.org"
                                 "/Users/atanas/Dropbox/Apps/org/school.org"
                                 "/Users/atanas/Dropbox/Apps/org/OrgTutorial.org"
                                 ))
    )
#+end_src


#+source: org-setup
#+begin_src emacs-lisp :tangle no
    (use-package org
    :ensure t
    :mode ("\\.org\\'" . org-mode)
    :bind (("C-c l" . org-store-link)
           ("C-c c" . org-capture)
           ("C-c a" . org-agenda)
           ("C-c b" . org-iswitchb)
           ("C-c C-w" . org-refile)
           ("C-c j" . org-clock-goto)
           ("C-c C-x C-o" . org-clock-out))
    :config
    (progn
      ;; The GTD part of this config is heavily inspired by
      ;; https://emacs.cafe/emacs/orgmode/gtd/2017/06/30/orgmode-gtd.html
      (setq org-directory "~/org")
      (setq org-agenda-files
            (mapcar (lambda (path) (concat org-directory path))
                    '("/org.org"
                      "/gtd/gtd.org"
                      "/gtd/inbox.org"
                      "/gtd/tickler.org")))
      (setq org-log-done 'time)
      (setq org-src-fontify-natively t)
      (setq org-use-speed-commands t)
      (setq org-capture-templates
            '(("t" "Todo [inbox]" entry
               (file+headline "~/org/gtd/inbox.org" "Tasks")
               "* TODO %i%?")
              ("T" "Tickler" entry
               (file+headline "~/org/gtd/tickler.org" "Tickler")
               "* %i%? \n %^t")))
      (setq org-refile-targets
            '(("~/org/gtd/gtd.org" :maxlevel . 3)
              ("~/org/gtd/someday.org" :level . 1)
              ("~/org/gtd/tickler.org" :maxlevel . 2)))
      (setq org-todo-keywords '((sequence "TODO(t)" "WAITING(w)" "|" "DONE(d)" "CANCELLED(c)")))
      (setq org-agenda-custom-commands
            '(("@" "Contexts"
               ((tags-todo "@email"
                           ((org-agenda-overriding-header "Emails")))
                (tags-todo "@phone"
                           ((org-agenda-overriding-header "Phone")))))))
      (setq org-clock-persist t)
      (org-clock-persistence-insinuate)
      (setq org-time-clocksum-format '(:hours "%d" :require-hours t :minutes ":%02d" :require-minutes t)))
    )

  (use-package org-inlinetask
    :bind (:map org-mode-map
                ("C-c C-x t" . org-inlinetask-insert-task))
    :after (org)
    :commands (org-inlinetask-insert-task)
    )

  (use-package org-bullets
    :ensure t
    :commands (org-bullets-mode)
    :init (add-hook 'org-mode-hook (lambda () (org-bullets-mode 1)))
    )

#+end_src

#+RESULTS: org-setup
| (lambda nil (org-bullets-mode 1)) | org-clock-load | pandoc-mode | org-bullets-mode | org-indent-mode | visual-line-mode | #[0 \300\301\302\303\304$\207 [add-hook change-major-mode-hook org-show-block-all append local] 5] | #[0 \300\301\302\303\304$\207 [add-hook change-major-mode-hook org-babel-show-result-all append local] 5] | org-babel-result-hide-spec | org-babel-hide-all-hashes |

